dgarske/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
/* Deterministic ML-KEM keygen+encap+decap round-trip (self-consistent: the two
 * shared secrets must match).  No external vectors needed. */
static int mlkem_roundtrip(int type, const char* name)
{
    static MlKemKey k;
    static byte ct[WC_ML_KEM_MAX_CIPHER_TEXT_SIZE];
    static byte ss1[WC_ML_KEM_SS_SZ];
    static byte ss2[WC_ML_KEM_SS_SZ];
    static byte seed[64];
    static byte coins[32];
    word32 ctSz = 0;
    int ret, ok = 0, i;

    for (i = 0; i < 64; i++) { seed[i]  = (byte)i; }
    for (i = 0; i < 32; i++) { coins[i] = (byte)(0x40 + i); }
    ret = wc_MlKemKey_Init(&k, type, NULL, INVALID_DEVID);
    if (ret == 0) {
        MEMPROF_BEGIN();
        ret = wc_MlKemKey_MakeKeyWithRandom(&k, seed, 64);
        MEMPROF_END(name, "make");
    }
    if (ret == 0) { ret = wc_MlKemKey_CipherTextSize(&k, &ctSz); }
    if (ret == 0) {
        MEMPROF_BEGIN();
        ret = wc_MlKemKey_EncapsulateWithRandom(&k, ct, ss1, coins, 32);
        MEMPROF_END(name, "encapsulate");
    }
    if (ret == 0) {
        MEMPROF_BEGIN();
        ret = wc_MlKemKey_Decapsulate(&k, ss2, ct, ctSz);
        MEMPROF_END(name, "decapsulate");
    }
    if (ret == 0) { ok = (XMEMCMP(ss1, ss2, WC_ML_KEM_SS_SZ) == 0); }
    printf("%s encap/decap round-trip: %s (ret=%d ss_match=%d)\r\n",
           name, (ret == 0 && ok) ? "PASS" : "FAIL", ret, ok);
#ifdef WOLF_MLKEM_BENCH
    if (ret == 0) {
        double t;
        int b;
        (void)current_time(1);
        for (b = 0; b < 10; b++) {
            (void)wc_MlKemKey_MakeKeyWithRandom(&k, seed, 64);
        }
        t = current_time(0);
        printf("%s keygen bench: 10 ops in %.3f s = %.2f ms/op\r\n",
               name, t, t * 1000.0 / 10);
        (void)current_time(1);
        for (b = 0; b < 10; b++) {
            (void)wc_MlKemKey_EncapsulateWithRandom(&k, ct, ss1, coins, 32);
        }
        t = current_time(0);
        printf("%s encap bench: 10 ops in %.3f s = %.2f ms/op\r\n",
               name, t, t * 1000.0 / 10);
        (void)current_time(1);
        for (b = 0; b < 10; b++) {
            (void)wc_MlKemKey_Decapsulate(&k, ss2, ct, ctSz);
        }
        t = current_time(0);
        printf("%s decap bench: 10 ops in %.3f s = %.2f ms/op\r\n",
               name, t, t * 1000.0 / 10);
    }
#endif /* WOLF_MLKEM_BENCH */
#ifdef WOLF_MEM_PROFILE
    printf("MEMPROF %s key_sizeof=%lu octets\r\n", name,
           (unsigned long)sizeof(k) * 2UL);
#endif
    wc_MlKemKey_Free(&k);
    return ret;
}
#endif /* WOLF_MLKEM */

#if defined(WOLF_MLDSA_SIGN)
/* Shared ML-DSA sign work buffers (RAM is tight in the sign image, so the 87
 * round-trip below and the 44/65 helper reuse one key + sig buffer). */
static wc_MlDsaKey sgk;
static byte sg_sig[5000];   /* ML-DSA-87 sig ~4627; covers 44/65/87 */
static byte sg_msg[64];

/* ML-DSA keygen+sign+verify round-trip for a given parameter set
 * (self-consistent: verify of the just-made signature must return res==1). */
static void mldsa_sign_roundtrip(int type, const char* name)
{
    WC_RNG rng;
    word32 sigLen = (word32)sizeof(sg_sig);
    int i, res = 0, ret;

    for (i = 0; i < (int)sizeof(sg_msg); i++) { sg_msg[i] = (byte)(i & 0xFF); }
    ret = wc_InitRng(&rng);
    if (ret == 0) { ret = wc_MlDsaKey_Init(&sgk, NULL, INVALID_DEVID); }
    if (ret == 0) { ret = wc_MlDsaKey_SetParams(&sgk, type); }
    if (ret == 0) { ret = wc_MlDsaKey_MakeKey(&sgk, &rng); }
    if (ret == 0) { ret = wc_MlDsaKey_SignCtx(&sgk, NULL, 0, sg_sig, &sigLen,
                                          sg_msg, (word32)sizeof(sg_msg), &rng); }
    if (ret == 0) { ret = wc_MlDsaKey_VerifyCtx(&sgk, sg_sig, sigLen, NULL, 0,
                                       sg_msg, (word32)sizeof(sg_msg), &res); }
    printf("%s sign/verify round-trip: %s (ret=%d res=%d sigLen=%lu)\r\n",
           name, (ret == 0 && res == 1) ? "PASS" : "FAIL", ret, res,
           (unsigned long)sigLen);
    wc_MlDsaKey_Free(&sgk);
    wc_FreeRng(&rng);
}
#endif /* WOLF_MLDSA_SIGN */

/* ------------------------------------------------------------------------- */
/* wolfSSL port hooks (referenced from user_settings.h)                      */
/* ------------------------------------------------------------------------- */
/* XTIME stub - hashing and ML-DSA verify never use wall-clock time. */
long my_time(long* t)
{
    if (t != NULL) {
        *t = 0;
    }
    return 0;
}

/* The RNG now uses the real SHA-256 Hash-DRBG seeded by WOLFSSL_GENSEED_FORTEST
 * (random.c's built-in test seed) - see user_settings.h.  Switching off the old
 * WC_NO_HASHDRBG custom-stub RNG (which leaked heap on every wc_InitRng) is what
 * lets wolfcrypt_test and the benchmark both run in one image. */

#ifdef WOLF_ECC
/* ECDSA P-256 + ECDH bring-up on the C28x (SP single-precision math):
 *   1. RNG-free verify KAT (RFC 6979 raw r/s; no ASN).
 *   2. keygen + sign + verify round-trip (uses the test DRBG).
 *   3. ECDH shared-secret agreement (both directions must match).
 */
static void wolf_ecc_test(void)
{
    /* ecc_key/WC_RNG are large under SP_NO_MALLOC; keep them off the stack so
     * the SP point-math call tree has the full 16 KW stack to work in. */
    static ecc_key key;
    static ecc_key keyA;
    static ecc_key keyB;
    static WC_RNG  rng;
    mp_int  r;
    mp_int  s;
    byte    secretA[32];
    byte    secretB[32];
    word32  lenA;
    word32  lenB;
    int     ret;
    int     res;
    int     verified;
    int     ok;
    word32  i;

    /* r and s are mp_clear()'d on every path below, including ones reached when
     * an earlier init fails and their mp_init() was skipped; zero them first so
     * that cleanup is safe. */
    XMEMSET(&r, 0, sizeof(r));
    XMEMSET(&s, 0, sizeof(s));

    /* 1. Deterministic verify KAT (no RNG; raw r/s -> no ASN/DER). */
    res = 0;
    ret = wc_ecc_init(&key);
    if (ret == 0) {
        ret = wc_ecc_import_unsigned(&key, (byte*)kat_p256_qx,
            (byte*)kat_p256_qy, NULL, ECC_SECP256R1);
    }
    if (ret == 0) {
        ret = mp_init_multi(&r, &s, NULL, NULL, NULL, NULL);
    }
    if (ret == 0) {
        ret = mp_read_unsigned_bin(&r, kat_p256_r, (int)sizeof(kat_p256_r));
    }
    if (ret == 0) {
        ret = mp_read_unsigned_bin(&s, kat_p256_s, (int)sizeof(kat_p256_s));
    }
    if (ret == 0) {
        ret = wc_ecc_verify_hash_ex(&r, &s, kat_p256_hash,
            (word32)sizeof(kat_p256_hash), &res, &key);
    }
    printf("ECDSA P-256 verify KAT: %s (ret=%d res=%d)\r\n",
           (ret == 0 && res == 1) ? "PASS" : "FAIL", ret, res);
    mp_clear(&r);
    mp_clear(&s);
    wc_ecc_free(&key);

    /* 2. keygen + sign + verify round-trip. */
    res = 0;
    verified = 0;
    ret = wc_InitRng(&rng);
    if (ret == 0) {
        ret = wc_ecc_init(&keyA);
    }
    if (ret == 0) {
        ret = wc_ecc_make_key_ex(&rng, 32, &keyA, ECC_SECP256R1);
    }
    if (ret == 0) {
        ret = wc_ecc_set_rng(&keyA, &rng);
    }
    if (ret == 0) {
        ret = mp_init_multi(&r, &s, NULL, NULL, NULL, NULL);
    }
    if (ret == 0) {
        ret = wc_ecc_sign_hash_ex(kat_p256_hash,
            (word32)sizeof(kat_p256_hash), &rng, &keyA, &r, &s);
    }
    if (ret == 0) {
        ret = wc_ecc_verify_hash_ex(&r, &s, kat_p256_hash,
            (word32)sizeof(kat_p256_hash), &verified, &keyA);
    }
    printf("ECDSA P-256 keygen/sign/verify: %s (ret=%d res=%d)\r\n",
           (ret == 0 && verified == 1) ? "PASS" : "FAIL", ret, verified);
    mp_clear(&r);
    mp_clear(&s);

    /* 3. ECDH: a second key + shared secret both ways must agree. */
    ret = wc_ecc_init(&keyB);
    if (ret == 0) {
        ret = wc_ecc_make_key_ex(&rng, 32, &keyB, ECC_SECP256R1);
    }
    if (ret == 0) {
        ret = wc_ecc_set_rng(&keyB, &rng);
    }
    lenA = (word32)sizeof(secretA);
    lenB = (word32)sizeof(secretB);
    if (ret == 0) {
        ret = wc_ecc_shared_secret(&keyA, &keyB, secretA, &lenA);
    }
    if (ret == 0) {
        ret = wc_ecc_shared_secret(&keyB, &keyA, secretB, &lenB);
    }
    ok = (ret == 0) && (lenA == lenB) && (lenA > 0);
    for (i = 0; ok && (i < lenA); i++) {
        if (secretA[i] != secretB[i]) {
            ok = 0;
        }
    }
    printf("ECDH P-256 shared secret: %s (ret=%d len=%lu)\r\n",
           ok ? "PASS" : "FAIL", ret, (unsigned long)lenA);
    wc_ecc_free(&keyB);
    wc_ecc_free(&keyA);
    wc_FreeRng(&rng);
}
#endif /* WOLF_ECC */

/* Focused SHA3-256 known-answer test (SHA3-256("abc")), to confirm the
 * 16-bit-byte Keccak path is correct on the C28x. */
static void wolf_sha3_256_test(void)
{
    static const byte kat_msg[3] = { 'a', 'b', 'c' };
    static const byte kat_exp[WC_SHA3_256_DIGEST_SIZE] = {
        0x3a,0x98,0x5d,0xa7,0x4f,0xe2,0x25,0xb2,
        0x04,0x5c,0x17,0x2d,0x6b,0xd3,0x90,0xbd,
        0x85,0x5f,0x08,0x6e,0x3e,0x9d,0x52,0x5b,
        0x46,0xbf,0xe2,0x45,0x11,0x43,0x15,0x32
    };
    wc_Sha3 kat_sha;
    byte    kat_out[WC_SHA3_256_DIGEST_SIZE];
    int     ki;
    int     kok = 1;

