dgarske/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    if (wc_InitSha3_256(&kat_sha, NULL, INVALID_DEVID) == 0) {
        (void)wc_Sha3_256_Update(&kat_sha, kat_msg, (word32)sizeof(kat_msg));
        (void)wc_Sha3_256_Final(&kat_sha, kat_out);
        wc_Sha3_256_Free(&kat_sha);
        printf("SHA3-256(abc)=");
        for (ki = 0; ki < (int)sizeof(kat_out); ki++) {
            printf("%02x", (unsigned)(kat_out[ki] & 0xFF));
        }
        printf("\r\n");
        for (ki = 0; ki < (int)sizeof(kat_out); ki++) {
            if (kat_out[ki] != kat_exp[ki]) {
                kok = 0;
            }
        }
        printf("SHA3-256 KAT: %s\r\n", kok ? "PASS" : "FAIL");
    }
    else {
        printf("SHA3-256 KAT: init failed\r\n");
    }
}

/* SHA-256 multi-block KAT (64 bytes 0x00..0x3f) - exercises the full-block
 * input path, not just the single-block Final path. */
static void wolf_sha256_test(void)
{
    static byte s2_msg[64];
    static const byte s2_exp[WC_SHA256_DIGEST_SIZE] = {
        0xfd,0xea,0xb9,0xac,0xf3,0x71,0x03,0x62,
        0xbd,0x26,0x58,0xcd,0xc9,0xa2,0x9e,0x8f,
        0x9c,0x75,0x7f,0xcf,0x98,0x11,0x60,0x3a,
        0x8c,0x44,0x7c,0xd1,0xd9,0x15,0x11,0x08
    };
    wc_Sha256 s2;
    byte s2o[WC_SHA256_DIGEST_SIZE];
    int si, sok = 1;
    for (si = 0; si < 64; si++) { s2_msg[si] = (byte)si; }
    if (wc_InitSha256(&s2) == 0) {
        (void)wc_Sha256Update(&s2, s2_msg, 64);
        (void)wc_Sha256Final(&s2, s2o);
        wc_Sha256Free(&s2);
        printf("SHA-256(64)=");
        for (si = 0; si < (int)sizeof(s2o); si++) {
            printf("%02x", (unsigned)(s2o[si] & 0xFF));
        }
        printf("\r\n");
        for (si = 0; si < (int)sizeof(s2o); si++) {
            if (s2o[si] != s2_exp[si]) { sok = 0; }
        }
        printf("SHA-256 (multiblock) KAT: %s\r\n", sok ? "PASS" : "FAIL");
    }
}

/* SHAKE256 multi-block KAT (256 bytes 0x00..0xff), 32-byte output -
 * exercises multi-block absorb (the path ML-DSA's mu/tr use). */
static void wolf_shake256_test(void)
{
    static byte sk_msg[256];
    static const byte sk_exp[32] = {
        0x33,0x6c,0x8a,0xa7,0xf2,0xb0,0x8b,0xda,
        0x6b,0xd7,0x40,0x2c,0xd2,0xea,0x89,0x76,
        0x0b,0x77,0x28,0xa8,0xb3,0x18,0x02,0xb8,
        0x05,0x24,0x75,0x63,0x61,0x16,0x53,0x66
    };
    wc_Shake sk1;
    byte o1[32];
    int i, match = 1, mu_ok = 1;
    for (i = 0; i < 256; i++) { sk_msg[i] = (byte)i; }
    if (wc_InitShake256(&sk1, NULL, INVALID_DEVID) == 0) {
        (void)wc_Shake256_Update(&sk1, sk_msg, 256);
        (void)wc_Shake256_Final(&sk1, o1, (word32)sizeof(o1));
        printf("SHAKE256(256)=");
        for (i = 0; i < 32; i++) { printf("%02x", (unsigned)(o1[i] & 0xFF)); }
        printf("\r\n");
        for (i = 0; i < 32; i++) { if (o1[i] != sk_exp[i]) { match = 0; } }
        printf("SHAKE256 (multiblock) KAT: %s\r\n", match ? "PASS" : "FAIL");
        wc_Shake256_Free(&sk1);
    }
    /* Same 256 bytes via 3 Updates (100+100+56) - exercises the
     * partial-buffer-fills-to-full absorb across Update calls (ML-DSA's
     * mu/tr feed several Updates). Must match the single-Update result. */
    if (wc_InitShake256(&sk1, NULL, INVALID_DEVID) == 0) {
        (void)wc_Shake256_Update(&sk1, sk_msg, 100);
        (void)wc_Shake256_Update(&sk1, sk_msg + 100, 100);
        (void)wc_Shake256_Update(&sk1, sk_msg + 200, 56);
        (void)wc_Shake256_Final(&sk1, o1, (word32)sizeof(o1));
        for (i = 0; i < 32; i++) { if (o1[i] != sk_exp[i]) { mu_ok = 0; } }
        printf("SHAKE256 (split Updates) KAT: %s\r\n", mu_ok ? "PASS" : "FAIL");
        wc_Shake256_Free(&sk1);
    }
}

#ifndef WOLF_MLDSA_SIGN
/* SHAKE256 large hash (100x1024 absorb -> 250-byte multi-block squeeze), the
 * exact test.c large-hash scenario, compared to test.c's large_digest -
 * validates multi-block absorb + multi-block squeeze on the C28x.  Skipped in
 * the SIGN build: its ~1.4 KW of static buffers would not fit alongside the
 * sign key + 32 KW heap. */
static void wolf_shake256_large_test(void)
{
    /* lg_in/lg_out are static (.bss) rather than stack: 1274 cells would be a
     * large bite out of the 16 KW C28x stack. */
    static byte lg_in[1024];
    static byte lg_out[250];
    static const byte lg_exp[114] = {
        0x90,0x32,0x4a,0xcc,0xd1,0xdf,0xb8,0x0b,0x79,0x1f,0xb8,0xc8,
        0x5b,0x54,0xc8,0xe7,0x45,0xf5,0x60,0x6b,0x38,0x26,0xb2,0x0a,
        0xee,0x38,0x01,0xf3,0xd9,0xfa,0x96,0x9f,0x6a,0xd7,0x15,0xdf,
        0xb6,0xc2,0xf4,0x20,0x33,0x44,0x55,0xe8,0x2a,0x09,0x2b,0x68,
        0x2e,0x18,0x65,0x5e,0x65,0x93,0x28,0xbc,0xb1,0x9e,0xe2,0xb1,
        0x92,0xea,0x98,0xac,0x21,0xef,0x4c,0xe1,0xb4,0xb7,0xbe,0x81,
        0x5c,0x1d,0xd3,0xb7,0x17,0xe5,0xbb,0xc5,0x8c,0x68,0xb7,0xfb,
        0xac,0x55,0x8a,0x9b,0x4d,0x91,0xe4,0x9f,0x72,0xbb,0x6e,0x38,
        0xaf,0x21,0x7d,0x21,0xaa,0x98,0x4e,0x75,0xc4,0xb4,0x1c,0x7c,
        0x50,0x45,0x54,0xf9,0xea,0x26 };
    wc_Shake sk1;
    int li, ok;

    for (li = 0; li < 1024; li++) { lg_in[li] = (byte)(li & 0xFF); }
    if (wc_InitShake256(&sk1, NULL, INVALID_DEVID) == 0) {
        for (li = 0; li < 100; li++)
            (void)wc_Shake256_Update(&sk1, lg_in, 1024);
        (void)wc_Shake256_Final(&sk1, lg_out, (word32)sizeof(lg_out));
        ok = 1;
        for (li = 0; li < 114; li++) if (lg_out[li] != lg_exp[li]) ok = 0;
        printf("SHAKE256 (large multiblock) KAT: %s\r\n",
            ok ? "PASS" : "FAIL");
        wc_Shake256_Free(&sk1);
    }
}
#endif /* !WOLF_MLDSA_SIGN */

/* SHA-512 / SHA-384 multi-block KATs (200 bytes 0x00..0xc7) - exercises the
 * octet-wise word64 byte-I/O (input load, 128-bit length, digest store). */
static void wolf_sha512_test(void)
{
    static byte h5_msg[200];
    static const byte sha512_exp[WC_SHA512_DIGEST_SIZE] = {
        0x98,0x60,0x58,0xe9,0x89,0x5e,0x2c,0x2a,
        0xb8,0xf9,0xe8,0xcb,0xdf,0x80,0x1d,0xb1,
        0x2a,0x44,0x84,0x2a,0x56,0xa9,0x1d,0x5a,
        0x4e,0x87,0xb1,0xfc,0x98,0xb2,0x93,0x72,
        0x2c,0x46,0x64,0x14,0x2e,0x42,0xc3,0xc5,
        0x51,0xff,0x89,0x86,0x46,0x26,0x8c,0xd9,
        0x2b,0x84,0xed,0x23,0x0b,0x8c,0x94,0xbe,
        0xd7,0x79,0x8d,0x4f,0x27,0xcd,0x74,0x65
    };
    static const byte sha384_exp[WC_SHA384_DIGEST_SIZE] = {
        0x7e,0xa4,0xbb,0x25,0x34,0xc6,0x70,0x36,
        0xf4,0x9d,0xe7,0xbe,0xb5,0xfe,0x8a,0x24,
        0x78,0xdf,0x04,0xff,0x3f,0xef,0x40,0xa9,
        0xcd,0x49,0x23,0x99,0x9a,0x59,0x0e,0x99,
        0x12,0xdf,0x12,0x97,0x21,0x7c,0xe1,0xa0,
        0x21,0xaa,0x2f,0xb1,0x01,0x34,0x98,0xb8
    };
    wc_Sha512 h512;
    wc_Sha384 h384;
    byte h5o[WC_SHA512_DIGEST_SIZE];
    int hi, h5ok = 1, h3ok = 1;
    for (hi = 0; hi < 200; hi++) { h5_msg[hi] = (byte)(hi & 0xFF); }
    if (wc_InitSha512(&h512) == 0) {
        (void)wc_Sha512Update(&h512, h5_msg, 200);
        (void)wc_Sha512Final(&h512, h5o);
        wc_Sha512Free(&h512);
        for (hi = 0; hi < WC_SHA512_DIGEST_SIZE; hi++) {
            if (h5o[hi] != sha512_exp[hi]) { h5ok = 0; }
        }
        printf("SHA-512 (multiblock) KAT: %s\r\n", h5ok ? "PASS" : "FAIL");
    }
    if (wc_InitSha384(&h384) == 0) {
        (void)wc_Sha384Update(&h384, h5_msg, 200);
        (void)wc_Sha384Final(&h384, h5o);
        wc_Sha384Free(&h384);
        for (hi = 0; hi < WC_SHA384_DIGEST_SIZE; hi++) {
            if (h5o[hi] != sha384_exp[hi]) { h3ok = 0; }
        }
        printf("SHA-384 (multiblock) KAT: %s\r\n", h3ok ? "PASS" : "FAIL");
    }
}

