dgarske/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
#ifdef WOLF_SHA1
static void wolf_sha1_test(void)
{
    /* SHA-1("abc") = a9993e36 4706816a ba3e2571 7850c26c 9cd0d89d */
    static const byte sha1_in[3] = { 0x61, 0x62, 0x63 };
    static const byte sha1_exp[WC_SHA_DIGEST_SIZE] = {
        0xa9,0x99,0x3e,0x36,0x47,0x06,0x81,0x6a,0xba,0x3e,
        0x25,0x71,0x78,0x50,0xc2,0x6c,0x9c,0xd0,0xd8,0x9d };
    wc_Sha sha1;
    byte sha1o[WC_SHA_DIGEST_SIZE];
    int s1ok = 1, si;
    if (wc_InitSha(&sha1) == 0) {
        (void)wc_ShaUpdate(&sha1, sha1_in, sizeof(sha1_in));
        (void)wc_ShaFinal(&sha1, sha1o);
        wc_ShaFree(&sha1);
        for (si = 0; si < WC_SHA_DIGEST_SIZE; si++) {
            if (sha1o[si] != sha1_exp[si]) { s1ok = 0; }
        }
        printf("SHA-1(abc) KAT: %s\r\n", s1ok ? "PASS" : "FAIL");
    }
}
#endif /* WOLF_SHA1 */

#ifndef WOLF_MLDSA_SIGN
/* ML-DSA-87 verify known-answer test (real pk/msg/sig from test.c).  This
 * is the primary deliverable: a deterministic, RNG-free verify on HW.
 * Key struct is static (large; WOLFSSL_MLDSA_VERIFY_NO_MALLOC pins buffers
 * into it). msg matches test.c's mldsa_param_vfy_test: msg[i] = (byte)i.
 * Skipped in the SIGN build: its static verify key would not fit alongside
 * the sign key + 32 KW heap, and the sign round-trip below also exercises
 * verify (of a freshly produced signature). */
static void wolf_mldsa87_verify_test(void)
{
    /* mldsa_key is static (.bss): WOLFSSL_MLDSA_VERIFY_NO_MALLOC pins the
     * verify workspace inside it, which is far too large for the 16 KW C28x
     * stack.  md_msg, by contrast, is deliberately left on the stack - it is
     * only 512 cells and it keeps the WOLF_STACK_PROFILE figure below a
     * true end-to-end measurement of the verify path. */
    static wc_MlDsaKey mldsa_key;
    byte md_msg[512];
    int  md_i;
    int  md_res = 0;
    int  md_ret;
#ifdef WOLF_MLDSA_VERIFY_BENCH
    int    bi;
    int    br = 0;
    double t;
#endif

    /* test.c builds this as msg[i] = (byte)i.  On an 8-bit-byte host that
     * wraps mod 256; a wolfCrypt 'byte' buffer must hold octet values, so
     * mask explicitly (a C28x 'byte' is a 16-bit cell and would otherwise
     * store 256..511 verbatim, corrupting the octet-wise hash input). */
    for (md_i = 0; md_i < (int)sizeof(md_msg); md_i++) {
        md_msg[md_i] = (byte)(md_i & 0xFF);
    }
    md_ret = wc_MlDsaKey_Init(&mldsa_key, NULL, INVALID_DEVID);
    if (md_ret == 0) {
        md_ret = wc_MlDsaKey_SetParams(&mldsa_key, WC_ML_DSA_87);
    }
    if (md_ret == 0) {
        md_ret = wc_MlDsaKey_ImportPubRaw(&mldsa_key, kat_mldsa87_pub,
            (word32)sizeof(kat_mldsa87_pub));
    }
    if (md_ret == 0) {
#ifdef WOLF_MEM_PROFILE
        wolf_heap_reset();
#endif
#ifdef WOLF_STACK_PROFILE
        wolf_paint_stack();
#endif
        md_ret = wc_MlDsaKey_VerifyCtx(&mldsa_key, kat_mldsa87_sig,
            (word32)sizeof(kat_mldsa87_sig), NULL, 0, md_msg,
            (word32)sizeof(md_msg), &md_res);
#ifdef WOLF_STACK_PROFILE
        wolf_measure_stack();
#endif
    }
    printf("ML-DSA-87 verify KAT: %s (ret=%d res=%d)\r\n",
           (md_ret == 0 && md_res == 1) ? "PASS" : "FAIL", md_ret, md_res);
#ifdef WOLF_MLDSA_VERIFY_BENCH
    /* Time the deterministic verify (CPU Timer 0 via current_time); 10 ops
     * keeps the interval under the ~28 s single-measurement wrap. */
    if ((md_ret == 0) && (md_res == 1)) {
        (void)current_time(1);
        for (bi = 0; bi < 10; bi++) {
            (void)wc_MlDsaKey_VerifyCtx(&mldsa_key, kat_mldsa87_sig,
                (word32)sizeof(kat_mldsa87_sig), NULL, 0, md_msg,
                (word32)sizeof(md_msg), &br);
        }
        t = current_time(0);
        printf("ML-DSA-87 verify bench: 10 ops in %.3f s = %.2f ms/op, "
               "%.2f ops/sec\r\n", t, (t * 1000.0) / 10.0, 10.0 / t);
    }
#endif
#ifdef WOLF_STACK_PROFILE
    printf("ML-DSA-87 verify: stack peak=0x%lx used=%lu words (key struct "
           "sizeof=%lu words); heap: VERIFY_NO_MALLOC\r\n",
           g_stk_peak, (g_stk_peak - WOLF_STK_BASE + 1UL),
           (unsigned long)sizeof(mldsa_key));
#endif
#ifdef WOLF_MEM_PROFILE
    printf("MEMPROF ML-DSA-87 verify: stack=%lu octets, heap_peak=%lu "
           "octets, key_sizeof=%lu octets\r\n",
           (g_stk_peak - WOLF_STK_BASE + 1UL) * 2UL, g_heap_peak * 2UL,
           (unsigned long)sizeof(mldsa_key) * 2UL);
#endif
    wc_MlDsaKey_Free(&mldsa_key);
}
#endif /* !WOLF_MLDSA_SIGN */

#ifdef WOLF_MLDSA_SIGN
/* ML-DSA-87 sign+verify round-trip (keygen -> sign -> verify).  Exercises
 * the full signer on the C28x.  Uses the DEV RNG stub (NOT secure) - this
 * proves functional correctness, not security. */
static void wolf_mldsa87_sign_test(void)
{
    WC_RNG sg_rng;
    word32 sg_sigLen = (word32)sizeof(sg_sig);
    int sg_i, sg_res = 0, sg_ret;
#ifdef WOLF_MLDSA_SIGN_BENCH
    double t;
    int    b;
#endif

    for (sg_i = 0; sg_i < (int)sizeof(sg_msg); sg_i++) {
        sg_msg[sg_i] = (byte)(sg_i & 0xFF);
    }
    sg_ret = wc_InitRng(&sg_rng);
    if (sg_ret == 0) {
        sg_ret = wc_MlDsaKey_Init(&sgk, NULL, INVALID_DEVID);
    }
    if (sg_ret == 0) {
        sg_ret = wc_MlDsaKey_SetParams(&sgk, WC_ML_DSA_87);
    }
    if (sg_ret == 0) {
        MEMPROF_BEGIN();
        sg_ret = wc_MlDsaKey_MakeKey(&sgk, &sg_rng);
        MEMPROF_END("ML-DSA-87", "keygen");
    }
    printf("ML-DSA-87 MakeKey: ret=%d\r\n", sg_ret);
    if (sg_ret == 0) {
        MEMPROF_BEGIN();
        sg_ret = wc_MlDsaKey_SignCtx(&sgk, NULL, 0, sg_sig, &sg_sigLen,
            sg_msg, (word32)sizeof(sg_msg), &sg_rng);
        MEMPROF_END("ML-DSA-87", "sign");
    }
    printf("ML-DSA-87 Sign: ret=%d sigLen=%lu\r\n", sg_ret,
           (unsigned long)sg_sigLen);
#ifdef WOLF_MEM_PROFILE
    printf("MEMPROF ML-DSA-87 key_sizeof=%lu octets\r\n",
           (unsigned long)sizeof(sgk) * 2UL);
#endif
    if (sg_ret == 0) {
        sg_ret = wc_MlDsaKey_VerifyCtx(&sgk, sg_sig, sg_sigLen, NULL, 0,
            sg_msg, (word32)sizeof(sg_msg), &sg_res);
    }
    printf("ML-DSA-87 sign/verify round-trip: %s (ret=%d res=%d)\r\n",
           (sg_ret == 0 && sg_res == 1) ? "PASS" : "FAIL", sg_ret, sg_res);
#ifdef WOLF_MLDSA_SIGN_BENCH
    if (sg_ret == 0) {
        (void)current_time(1);
        for (b = 0; b < 3; b++) {
            (void)wc_MlDsaKey_MakeKey(&sgk, &sg_rng);
        }
        t = current_time(0);
        printf("ML-DSA-87 keygen bench: 3 ops in %.3f s = %.2f ms/op\r\n",
               t, t * 1000.0 / 3);
        (void)current_time(1);
        for (b = 0; b < 3; b++) {
            sg_sigLen = (word32)sizeof(sg_sig);
            (void)wc_MlDsaKey_SignCtx(&sgk, NULL, 0, sg_sig, &sg_sigLen,
                sg_msg, (word32)sizeof(sg_msg), &sg_rng);
        }
        t = current_time(0);
        printf("ML-DSA-87 sign bench: 3 ops in %.3f s = %.2f ms/op\r\n",
               t, t * 1000.0 / 3);
    }
#endif /* WOLF_MLDSA_SIGN_BENCH */
    wc_MlDsaKey_Free(&sgk);
    wc_FreeRng(&sg_rng);
}
#endif /* WOLF_MLDSA_SIGN */

#ifdef WOLF_MLKEM
static void wolf_mlkem768_test(void)
{
    /* Key struct and key/CT buffers are static (.bss), NOT stack: the C28x
     * stack pointer is 16-bit, so the whole stack is 16 KW (see the linker
     * command file), and MlKemKey plus the encoded public/private key buffers
     * alone would overflow it.  Same rule as README.md "Notes on the C28x". */
    static MlKemKey kemk;
    static byte kem_pk[WC_ML_KEM_768_PUBLIC_KEY_SIZE];
    static byte kem_sk[WC_ML_KEM_768_PRIVATE_KEY_SIZE];
    static byte kem_ct[WC_ML_KEM_768_CIPHER_TEXT_SIZE];
    static byte kem_ss1[WC_ML_KEM_SS_SZ];
    static byte kem_ss2[WC_ML_KEM_SS_SZ];
    static byte kem_seed[64];
    static byte kem_coins[32];
    word32 kem_pklen = (word32)sizeof(kem_pk);
    word32 kem_sklen = (word32)sizeof(kem_sk);
    int kem_ret, kem_ok = 0, i;

    /* Deterministic seed/coins identical to the host reference dumper, so
     * pk/ct/ss can be diffed byte-for-byte to localize a CHAR_BIT==16 bug. */
    for (i = 0; i < 64; i++) {
        kem_seed[i] = (byte)i;
    }
    for (i = 0; i < 32; i++) {
        kem_coins[i] = (byte)(0x40 + i);
    }
    kem_ret = wc_MlKemKey_Init(&kemk, WC_ML_KEM_768, NULL, INVALID_DEVID);
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_MakeKeyWithRandom(&kemk, kem_seed, 64);
    }
    printf("ML-KEM-768 MakeKey: ret=%d\r\n", kem_ret);
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_EncodePublicKey(&kemk, kem_pk, kem_pklen);
    }
    if (kem_ret == 0) {
        kem_dump("PK", kem_pk, (int)kem_pklen, 32, 16);
    }
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_EncodePrivateKey(&kemk, kem_sk, kem_sklen);
    }
    if (kem_ret == 0) {
        kem_dump("SK", kem_sk, (int)sizeof(kem_sk), 32, 16);
    }
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_EncapsulateWithRandom(&kemk, kem_ct, kem_ss1,
            kem_coins, 32);
    }
    printf("ML-KEM-768 Encapsulate: ret=%d\r\n", kem_ret);
    if (kem_ret == 0) {
        kem_dump("CT", kem_ct, (int)sizeof(kem_ct), 32, 16);
        kem_dump("SS", kem_ss1, (int)WC_ML_KEM_SS_SZ, 32, 0);
    }
    if (kem_ret == 0) {
        kem_ret = wc_MlKemKey_Decapsulate(&kemk, kem_ss2, kem_ct,
            (word32)sizeof(kem_ct));
    }
    if (kem_ret == 0) {
        kem_ok = (XMEMCMP(kem_ss1, kem_ss2, WC_ML_KEM_SS_SZ) == 0);
    }
    printf("ML-KEM-768 encap/decap round-trip: %s (ret=%d ss_match=%d)\r\n",
           (kem_ret == 0 && kem_ok) ? "PASS" : "FAIL", kem_ret, kem_ok);
    wc_MlKemKey_Free(&kemk);
}
#endif /* WOLF_MLKEM */

#ifdef WOLF_AES
static void wolf_aes_test(void)
{
    /* AES-128 NIST SP800-38A vectors (CBC/CTR/CFB) + McGrew GCM case 2. */
    static const byte k[16] = {
        0x2b,0x7e,0x15,0x16,0x28,0xae,0xd2,0xa6,
        0xab,0xf7,0x15,0x88,0x09,0xcf,0x4f,0x3c};
    static const byte iv[16] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f};
    static const byte pt[16] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a};
    static const byte cbc_ct[16] = {
        0x76,0x49,0xab,0xac,0x81,0x19,0xb2,0x46,
        0xce,0xe9,0x8e,0x9b,0x12,0xe9,0x19,0x7d};
    static const byte ctr_iv[16] = {
        0xf0,0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,
        0xf8,0xf9,0xfa,0xfb,0xfc,0xfd,0xfe,0xff};
    static const byte ctr_ct[16] = {
        0x87,0x4d,0x61,0x91,0xb6,0x20,0xe3,0x26,
        0x1b,0xef,0x68,0x64,0x99,0x0d,0xb6,0xce};
    static const byte cfb_ct[16] = {
        0x3b,0x3f,0xd9,0x2e,0xb7,0x2d,0xad,0x20,
        0x33,0x34,0x49,0xf8,0xe8,0x3c,0xfb,0x4a};
    static const byte gk[16] = {0};
    static const byte giv[12] = {0};
    static const byte gpt[16] = {0};
    static const byte gct[16] = {
        0x03,0x88,0xda,0xce,0x60,0xb6,0xa3,0x92,
        0xf3,0x28,0xc2,0xb9,0x71,0xb2,0xfe,0x78};
    static const byte gtag[16] = {
        0xab,0x6e,0x47,0xd4,0x2c,0xec,0x13,0xbd,
        0xf5,0x3a,0x67,0xb2,0x12,0x57,0xbd,0xdf};
    static Aes aes;
    static byte o[16], o2[16], tag[16];
    int r;

    /* CBC */
    r = wc_AesSetKey(&aes, k, 16, iv, AES_ENCRYPTION);
    if (r == 0) r = wc_AesCbcEncrypt(&aes, o, pt, 16);
    printf("AES-128-CBC encrypt: %s\r\n",
        (r == 0 && XMEMCMP(o, cbc_ct, 16) == 0) ? "PASS" : "FAIL");
    r = wc_AesSetKey(&aes, k, 16, iv, AES_DECRYPTION);
    if (r == 0) r = wc_AesCbcDecrypt(&aes, o2, cbc_ct, 16);
    printf("AES-128-CBC decrypt: %s\r\n",
        (r == 0 && XMEMCMP(o2, pt, 16) == 0) ? "PASS" : "FAIL");

