dgarske/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    wc_AesFree(&hw);
    wc_AesFree(&sw);
}
#endif /* WOLF_HWAES */

#ifdef WOLF_25519
static void wolf_curve25519_test(void)
{
    /* X25519 RFC 7748 6.1 Diffie-Hellman test vectors (little-endian). */
    static const byte a_priv[32] = {
        0x77,0x07,0x6d,0x0a,0x73,0x18,0xa5,0x7d,0x3c,0x16,0xc1,0x72,0x51,0xb2,0x66,0x45,
        0xdf,0x4c,0x2f,0x87,0xeb,0xc0,0x99,0x2a,0xb1,0x77,0xfb,0xa5,0x1d,0xb9,0x2c,0x2a};
    static const byte a_pub[32] = {
        0x85,0x20,0xf0,0x09,0x89,0x30,0xa7,0x54,0x74,0x8b,0x7d,0xdc,0xb4,0x3e,0xf7,0x5a,
        0x0d,0xbf,0x3a,0x0d,0x26,0x38,0x1a,0xf4,0xeb,0xa4,0xa9,0x8e,0xaa,0x9b,0x4e,0x6a};
    static const byte b_priv[32] = {
        0x5d,0xab,0x08,0x7e,0x62,0x4a,0x8a,0x4b,0x79,0xe1,0x7f,0x8b,0x83,0x80,0x0e,0xe6,
        0x6f,0x3b,0xb1,0x29,0x26,0x18,0xb6,0xfd,0x1c,0x2f,0x8b,0x27,0xff,0x88,0xe0,0xeb};
    static const byte b_pub[32] = {
        0xde,0x9e,0xdb,0x7d,0x7b,0x7d,0xc1,0xb4,0xd3,0x5b,0x61,0xc2,0xec,0xe4,0x35,0x37,
        0x3f,0x83,0x43,0xc8,0x5b,0x78,0x67,0x4d,0xad,0xfc,0x7e,0x14,0x6f,0x88,0x2b,0x4f};
    static const byte x_K[32] = {
        0x4a,0x5d,0x9d,0x5b,0xa4,0xce,0x2d,0xe1,0x72,0x8e,0x3b,0xf4,0x80,0x35,0x0f,0x25,
        0xe0,0x7e,0x21,0xc9,0x47,0xd1,0x9e,0x33,0x76,0xf0,0x9b,0x3c,0x1e,0x16,0x17,0x42};
    /* Ed25519 RFC 8032 Test 1 (empty message). */
    static const byte ed_sk[32] = {
        0x9d,0x61,0xb1,0x9d,0xef,0xfd,0x5a,0x60,0xba,0x84,0x4a,0xf4,0x92,0xec,0x2c,0xc4,
        0x44,0x49,0xc5,0x69,0x7b,0x32,0x69,0x19,0x70,0x3b,0xac,0x03,0x1c,0xae,0x7f,0x60};
    static const byte ed_pk[32] = {
        0xd7,0x5a,0x98,0x01,0x82,0xb1,0x0a,0xb7,0xd5,0x4b,0xfe,0xd3,0xc9,0x64,0x07,0x3a,
        0x0e,0xe1,0x72,0xf3,0xda,0xa6,0x23,0x25,0xaf,0x02,0x1a,0x68,0xf7,0x07,0x51,0x1a};
    static const byte ed_sig[64] = {
        0xe5,0x56,0x43,0x00,0xc3,0x60,0xac,0x72,0x90,0x86,0xe2,0xcc,0x80,0x6e,0x82,0x8a,
        0x84,0x87,0x7f,0x1e,0xb8,0xe5,0xd9,0x74,0xd8,0x73,0xe0,0x65,0x22,0x49,0x01,0x55,
        0x5f,0xb8,0x82,0x15,0x90,0xa3,0x3b,0xac,0xc6,0x1e,0x39,0x70,0x1c,0xf9,0xb4,0x6b,
        0xd2,0x5b,0xf5,0xf0,0x59,0x5b,0xbe,0x24,0x65,0x51,0x41,0x43,0x8e,0x7a,0x10,0x0b};
    static curve25519_key ca, cpa, cb, cpb;
    static ed25519_key ed;
    static WC_RNG rng;
    byte sh[32], sig[64], ap[32], bp[32];
    word32 shLen = sizeof(sh), sigLen = sizeof(sig);
    int r, vres = 0, ci, rngOk;

    /* X25519: shared = X25519(a_priv, b_pub) == X25519(b_priv, a_pub) == K.
     * wolfSSL requires the scalar to be pre-clamped (RFC 7748 sec 5); the
     * raw RFC 6.1 keys are not, so clamp a local copy (X25519 clamps the
     * same bits internally, so the shared secret still equals K).  The
     * default C build enables WOLFSSL_CURVE25519_BLINDING, so each private
     * key needs an RNG set (the result is unaffected). */
    rngOk = (wc_InitRng(&rng) == 0);
    if (!rngOk)
        printf("X25519: RNG init FAIL\r\n");
    for (ci = 0; ci < 32; ci++) { ap[ci] = a_priv[ci]; bp[ci] = b_priv[ci]; }
    ap[0] &= 248; ap[31] &= 127; ap[31] |= 64;
    bp[0] &= 248; bp[31] &= 127; bp[31] |= 64;
    wc_curve25519_init(&ca);  wc_curve25519_init(&cpb);
    r = wc_curve25519_import_private_ex(ap, 32, &ca, EC25519_LITTLE_ENDIAN);
    if (r == 0 && rngOk) r = wc_curve25519_set_rng(&ca, &rng);
    if (r == 0) r = wc_curve25519_import_public_ex(b_pub, 32, &cpb,
                                            EC25519_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve25519_shared_secret_ex(&ca, &cpb, sh, &shLen,
                                            EC25519_LITTLE_ENDIAN);
    printf("X25519 a*Bpub: %s\r\n",
        (r == 0 && shLen == 32 && XMEMCMP(sh, x_K, 32) == 0) ? "PASS":"FAIL");

    wc_curve25519_init(&cb);  wc_curve25519_init(&cpa);
    shLen = sizeof(sh);
    r = wc_curve25519_import_private_ex(bp, 32, &cb, EC25519_LITTLE_ENDIAN);
    if (r == 0 && rngOk) r = wc_curve25519_set_rng(&cb, &rng);
    if (r == 0) r = wc_curve25519_import_public_ex(a_pub, 32, &cpa,
                                            EC25519_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve25519_shared_secret_ex(&cb, &cpa, sh, &shLen,
                                            EC25519_LITTLE_ENDIAN);
    printf("X25519 b*Apub: %s\r\n",
        (r == 0 && shLen == 32 && XMEMCMP(sh, x_K, 32) == 0) ? "PASS":"FAIL");
    wc_curve25519_free(&ca); wc_curve25519_free(&cpb);
    wc_curve25519_free(&cb); wc_curve25519_free(&cpa);
    if (rngOk) wc_FreeRng(&rng);

    /* Ed25519 RFC 8032 Test 1 (empty message): import (re-derives and
     * validates the public key on import), sign, compare to the RFC sig,
     * then verify.  inLen 0 still needs a non-NULL message pointer. */
    wc_ed25519_init(&ed);
    r = wc_ed25519_import_private_key(ed_sk, 32, ed_pk, 32, &ed);
    if (r == 0) r = wc_ed25519_sign_msg(ap, 0, sig, &sigLen, &ed);
    printf("Ed25519 sign:   %s\r\n",
        (r == 0 && sigLen == 64 && XMEMCMP(sig, ed_sig, 64) == 0) ?
        "PASS":"FAIL");
    r = wc_ed25519_verify_msg(ed_sig, 64, ap, 0, &vres, &ed);
    printf("Ed25519 verify: %s\r\n",
        (r == 0 && vres == 1) ? "PASS":"FAIL");
    wc_ed25519_free(&ed);
}
#endif /* WOLF_25519 */

#ifdef WOLF_448
static void wolf_curve448_test(void)
{
    /* X448 RFC 7748 6.2 Diffie-Hellman test vectors (little-endian). */
    static const byte x_a_priv[56] = {
        0x9a,0x8f,0x49,0x25,0xd1,0x51,0x9f,0x57,0x75,0xcf,0x46,0xb0,0x4b,0x58,0x00,0xd4,
        0xee,0x9e,0xe8,0xba,0xe8,0xbc,0x55,0x65,0xd4,0x98,0xc2,0x8d,0xd9,0xc9,0xba,0xf5,
        0x74,0xa9,0x41,0x97,0x44,0x89,0x73,0x91,0x00,0x63,0x82,0xa6,0xf1,0x27,0xab,0x1d,
        0x9a,0xc2,0xd8,0xc0,0xa5,0x98,0x72,0x6b
    };
    static const byte x_a_pub[56] = {
        0x9b,0x08,0xf7,0xcc,0x31,0xb7,0xe3,0xe6,0x7d,0x22,0xd5,0xae,0xa1,0x21,0x07,0x4a,
        0x27,0x3b,0xd2,0xb8,0x3d,0xe0,0x9c,0x63,0xfa,0xa7,0x3d,0x2c,0x22,0xc5,0xd9,0xbb,
        0xc8,0x36,0x64,0x72,0x41,0xd9,0x53,0xd4,0x0c,0x5b,0x12,0xda,0x88,0x12,0x0d,0x53,
        0x17,0x7f,0x80,0xe5,0x32,0xc4,0x1f,0xa0
    };
    static const byte x_b_priv[56] = {
        0x1c,0x30,0x6a,0x7a,0xc2,0xa0,0xe2,0xe0,0x99,0x0b,0x29,0x44,0x70,0xcb,0xa3,0x39,
        0xe6,0x45,0x37,0x72,0xb0,0x75,0x81,0x1d,0x8f,0xad,0x0d,0x1d,0x69,0x27,0xc1,0x20,
        0xbb,0x5e,0xe8,0x97,0x2b,0x0d,0x3e,0x21,0x37,0x4c,0x9c,0x92,0x1b,0x09,0xd1,0xb0,
        0x36,0x6f,0x10,0xb6,0x51,0x73,0x99,0x2d
    };
    static const byte x_b_pub[56] = {
        0x3e,0xb7,0xa8,0x29,0xb0,0xcd,0x20,0xf5,0xbc,0xfc,0x0b,0x59,0x9b,0x6f,0xec,0xcf,
        0x6d,0xa4,0x62,0x71,0x07,0xbd,0xb0,0xd4,0xf3,0x45,0xb4,0x30,0x27,0xd8,0xb9,0x72,
        0xfc,0x3e,0x34,0xfb,0x42,0x32,0xa1,0x3c,0xa7,0x06,0xdc,0xb5,0x7a,0xec,0x3d,0xae,
        0x07,0xbd,0xc1,0xc6,0x7b,0xf3,0x36,0x09
    };
    static const byte x_K[56] = {
        0x07,0xff,0xf4,0x18,0x1a,0xc6,0xcc,0x95,0xec,0x1c,0x16,0xa9,0x4a,0x0f,0x74,0xd1,
        0x2d,0xa2,0x32,0xce,0x40,0xa7,0x75,0x52,0x28,0x1d,0x28,0x2b,0xb6,0x0c,0x0b,0x56,
        0xfd,0x24,0x64,0xc3,0x35,0x54,0x39,0x36,0x52,0x1c,0x24,0x40,0x30,0x85,0xd5,0x9a,
        0x44,0x9a,0x50,0x37,0x51,0x4a,0x87,0x9d
    };
    /* Ed448 RFC 8032 7.4 first test ("Blank": empty message, empty
     * context).  The 57-byte secret/public keys and 114-byte signature. */
    static const byte ed_sk[57] = {
        0x6c,0x82,0xa5,0x62,0xcb,0x80,0x8d,0x10,0xd6,0x32,0xbe,0x89,0xc8,0x51,0x3e,0xbf,
        0x6c,0x92,0x9f,0x34,0xdd,0xfa,0x8c,0x9f,0x63,0xc9,0x96,0x0e,0xf6,0xe3,0x48,0xa3,
        0x52,0x8c,0x8a,0x3f,0xcc,0x2f,0x04,0x4e,0x39,0xa3,0xfc,0x5b,0x94,0x49,0x2f,0x8f,
        0x03,0x2e,0x75,0x49,0xa2,0x00,0x98,0xf9,0x5b
    };
    static const byte ed_pk[57] = {
        0x5f,0xd7,0x44,0x9b,0x59,0xb4,0x61,0xfd,0x2c,0xe7,0x87,0xec,0x61,0x6a,0xd4,0x6a,
        0x1d,0xa1,0x34,0x24,0x85,0xa7,0x0e,0x1f,0x8a,0x0e,0xa7,0x5d,0x80,0xe9,0x67,0x78,
        0xed,0xf1,0x24,0x76,0x9b,0x46,0xc7,0x06,0x1b,0xd6,0x78,0x3d,0xf1,0xe5,0x0f,0x6c,
        0xd1,0xfa,0x1a,0xbe,0xaf,0xe8,0x25,0x61,0x80
    };
    static const byte ed_sig[114] = {
        0x53,0x3a,0x37,0xf6,0xbb,0xe4,0x57,0x25,0x1f,0x02,0x3c,0x0d,0x88,0xf9,0x76,0xae,
        0x2d,0xfb,0x50,0x4a,0x84,0x3e,0x34,0xd2,0x07,0x4f,0xd8,0x23,0xd4,0x1a,0x59,0x1f,
        0x2b,0x23,0x3f,0x03,0x4f,0x62,0x82,0x81,0xf2,0xfd,0x7a,0x22,0xdd,0xd4,0x7d,0x78,
        0x28,0xc5,0x9b,0xd0,0xa2,0x1b,0xfd,0x39,0x80,0xff,0x0d,0x20,0x28,0xd4,0xb1,0x8a,
        0x9d,0xf6,0x3e,0x00,0x6c,0x5d,0x1c,0x2d,0x34,0x5b,0x92,0x5d,0x8d,0xc0,0x0b,0x41,
        0x04,0x85,0x2d,0xb9,0x9a,0xc5,0xc7,0xcd,0xda,0x85,0x30,0xa1,0x13,0xa0,0xf4,0xdb,
        0xb6,0x11,0x49,0xf0,0x5a,0x73,0x63,0x26,0x8c,0x71,0xd9,0x58,0x08,0xff,0x2e,0x65,
        0x26,0x00
    };
    static curve448_key xa, xpa, xb, xpb;
    static ed448_key ed;
    byte sh[56], sig[114];
    word32 shLen = sizeof(sh), sigLen = sizeof(sig);
    int r, vres = 0;

    /* X448: shared = X448(a_priv, b_pub) == X448(b_priv, a_pub) == K.
     * wc_curve448 clamps the scalar internally, so the raw RFC scalars
     * import directly; no caller-side clamp or RNG/blinding is needed. */
    wc_curve448_init(&xa);  wc_curve448_init(&xpb);
    r = wc_curve448_import_private_ex(x_a_priv, 56, &xa, EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_import_public_ex(x_b_pub, 56, &xpb,
                                            EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_shared_secret_ex(&xa, &xpb, sh, &shLen,
                                            EC448_LITTLE_ENDIAN);
    printf("X448 a*Bpub: %s\r\n",
        (r == 0 && shLen == 56 && XMEMCMP(sh, x_K, 56) == 0) ? "PASS":"FAIL");

