dgarske/wolfssl-examples/embedded/ti-c2000-f28p55x/Source/wolf_main.c
    wc_curve448_init(&xb);  wc_curve448_init(&xpa);
    shLen = sizeof(sh);
    r = wc_curve448_import_private_ex(x_b_priv, 56, &xb, EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_import_public_ex(x_a_pub, 56, &xpa,
                                            EC448_LITTLE_ENDIAN);
    if (r == 0) r = wc_curve448_shared_secret_ex(&xb, &xpa, sh, &shLen,
                                            EC448_LITTLE_ENDIAN);
    printf("X448 b*Apub: %s\r\n",
        (r == 0 && shLen == 56 && XMEMCMP(sh, x_K, 56) == 0) ? "PASS":"FAIL");
    wc_curve448_free(&xa); wc_curve448_free(&xpb);
    wc_curve448_free(&xb); wc_curve448_free(&xpa);

    /* Ed448 RFC 8032 7.4 (blank): import, sign empty message with empty
     * context, compare to the RFC signature, then verify. */
    wc_ed448_init(&ed);
    r = wc_ed448_import_private_key(ed_sk, 57, ed_pk, 57, &ed);
    if (r == 0) r = wc_ed448_sign_msg(ed_sk, 0, sig, &sigLen, &ed, NULL, 0);
    printf("Ed448 sign:   %s\r\n",
        (r == 0 && sigLen == 114 && XMEMCMP(sig, ed_sig, 114) == 0) ?
        "PASS":"FAIL");
    r = wc_ed448_verify_msg(ed_sig, 114, ed_sk, 0, &vres, &ed, NULL, 0);
    printf("Ed448 verify: %s\r\n",
        (r == 0 && vres == 1) ? "PASS":"FAIL");
    wc_ed448_free(&ed);
}
#endif /* WOLF_448 */

#ifdef WOLF_HKDF
static void wolf_hkdf_test(void)
{
    /* HMAC-SHA256: RFC 4231 test case 2. */
    static const byte hk[4]  = {0x4a,0x65,0x66,0x65}; /* "Jefe" */
    static const byte hd[28] = {
        0x77,0x68,0x61,0x74,0x20,0x64,0x6f,0x20,0x79,0x61,0x20,0x77,0x61,0x6e,
        0x74,0x20,0x66,0x6f,0x72,0x20,0x6e,0x6f,0x74,0x68,0x69,0x6e,0x67,0x3f};
    static const byte hmac_exp[32] = {
        0x5b,0xdc,0xc1,0x46,0xbf,0x60,0x75,0x4e,0x6a,0x04,0x24,0x26,0x08,0x95,
        0x75,0xc7,0x5a,0x00,0x3f,0x08,0x9d,0x27,0x39,0x83,0x9d,0xec,0x58,0xb9,
        0x64,0xec,0x38,0x43};
    /* HKDF-SHA256: RFC 5869 test case 1. */
    static const byte ikm[22] = {
        0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,
        0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b};
    static const byte salt[13] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c};
    static const byte info[10] = {
        0xf0,0xf1,0xf2,0xf3,0xf4,0xf5,0xf6,0xf7,0xf8,0xf9};
    static const byte okm_exp[42] = {
        0x3c,0xb2,0x5f,0x25,0xfa,0xac,0xd5,0x7a,0x90,0x43,0x4f,0x64,0xd0,0x36,
        0x2f,0x2a,0x2d,0x2d,0x0a,0x90,0xcf,0x1a,0x5a,0x4c,0x5d,0xb0,0x2d,0x56,
        0xec,0xc4,0xc5,0xbf,0x34,0x00,0x72,0x08,0xd5,0xb8,0x87,0x18,0x58,0x65};
    Hmac hmac;
    byte mac[32], okm[42];
    int r;

    r = wc_HmacInit(&hmac, NULL, INVALID_DEVID);
    if (r == 0) r = wc_HmacSetKey(&hmac, WC_SHA256, hk, sizeof(hk));
    if (r == 0) r = wc_HmacUpdate(&hmac, hd, sizeof(hd));
    if (r == 0) r = wc_HmacFinal(&hmac, mac);
    printf("HMAC-SHA256:  %s\r\n",
        (r == 0 && XMEMCMP(mac, hmac_exp, 32) == 0) ? "PASS":"FAIL");
    wc_HmacFree(&hmac);

    r = wc_HKDF(WC_SHA256, ikm, sizeof(ikm), salt, sizeof(salt),
                info, sizeof(info), okm, sizeof(okm));
    printf("HKDF-SHA256:  %s\r\n",
        (r == 0 && XMEMCMP(okm, okm_exp, 42) == 0) ? "PASS":"FAIL");
}
#endif /* WOLF_HKDF */

#ifdef WOLF_CHACHA
static void wolf_poly1305_test(void)
{
    /* Standalone Poly1305 (RFC 8439 sec 2.5.2) to isolate MAC vs AEAD. */
    static const byte pk[32] = {
        0x85,0xd6,0xbe,0x78,0x57,0x55,0x6d,0x33,0x7f,0x44,0x52,0xfe,0x42,0xd5,0x06,0xa8,
        0x01,0x03,0x80,0x8a,0xfb,0x0d,0xb2,0xfd,0x4a,0xbf,0xf6,0xaf,0x41,0x49,0xf5,0x1b};
    static const byte pm[34] = {
        0x43,0x72,0x79,0x70,0x74,0x6f,0x67,0x72,0x61,0x70,0x68,0x69,0x63,0x20,0x46,0x6f,
        0x72,0x75,0x6d,0x20,0x52,0x65,0x73,0x65,0x61,0x72,0x63,0x68,0x20,0x47,0x72,0x6f,
        0x75,0x70};
    static const byte ptag_exp[16] = {
        0xa8,0x06,0x1d,0xc1,0x30,0x51,0x36,0xc6,0xc2,0x2b,0x8b,0xaf,0x0c,0x01,0x27,0xa9};
    Poly1305 poly;
    byte ptag[16];
    int pr;
    pr = wc_Poly1305SetKey(&poly, pk, sizeof(pk));
    if (pr == 0) pr = wc_Poly1305Update(&poly, pm, sizeof(pm));
    if (pr == 0) pr = wc_Poly1305Final(&poly, ptag);
    printf("Poly1305 (standalone): %s (t=%02x%02x%02x%02x exp=a8061dc1)\r\n",
        (pr == 0 && XMEMCMP(ptag, ptag_exp, 16) == 0) ? "PASS":"FAIL",
        ptag[0]&0xFF, ptag[1]&0xFF, ptag[2]&0xFF, ptag[3]&0xFF);
}
#endif /* WOLF_CHACHA */

#ifdef WOLF_CHACHA
static void wolf_chacha20_poly1305_test(void)
{
    static const byte key[32] = {
        0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,0x88,0x89,0x8a,0x8b,0x8c,0x8d,0x8e,0x8f,
        0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97,0x98,0x99,0x9a,0x9b,0x9c,0x9d,0x9e,0x9f};
    static const byte iv[12] = {
        0x07,0x00,0x00,0x00,0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47};
    static const byte aad[12] = {
        0x50,0x51,0x52,0x53,0xc0,0xc1,0xc2,0xc3,0xc4,0xc5,0xc6,0xc7};
    static const byte pt[114] = {
        0x4c,0x61,0x64,0x69,0x65,0x73,0x20,0x61,0x6e,0x64,0x20,0x47,0x65,0x6e,0x74,0x6c,
        0x65,0x6d,0x65,0x6e,0x20,0x6f,0x66,0x20,0x74,0x68,0x65,0x20,0x63,0x6c,0x61,0x73,
        0x73,0x20,0x6f,0x66,0x20,0x27,0x39,0x39,0x3a,0x20,0x49,0x66,0x20,0x49,0x20,0x63,
        0x6f,0x75,0x6c,0x64,0x20,0x6f,0x66,0x66,0x65,0x72,0x20,0x79,0x6f,0x75,0x20,0x6f,
        0x6e,0x6c,0x79,0x20,0x6f,0x6e,0x65,0x20,0x74,0x69,0x70,0x20,0x66,0x6f,0x72,0x20,
        0x74,0x68,0x65,0x20,0x66,0x75,0x74,0x75,0x72,0x65,0x2c,0x20,0x73,0x75,0x6e,0x73,
        0x63,0x72,0x65,0x65,0x6e,0x20,0x77,0x6f,0x75,0x6c,0x64,0x20,0x62,0x65,0x20,0x69,
        0x74,0x2e};
    static const byte ct0[4]  = {0xd3,0x1a,0x8d,0x34}; /* RFC ciphertext head */
    static const byte tag_exp[16] = {
        0x1a,0xe1,0x0b,0x59,0x4f,0x09,0xe2,0x6a,0x7e,0x90,0x2e,0xcb,0xd0,0x60,0x06,0x91};
    static byte ct[114], tag[16], dec[114];
    int r;

    r = wc_ChaCha20Poly1305_Encrypt(key, iv, aad, sizeof(aad),
            pt, sizeof(pt), ct, tag);
    printf("ChaCha20-Poly1305 encrypt: %s (r=%d)\r\n",
        (r == 0 && XMEMCMP(ct, ct0, 4) == 0 &&
         XMEMCMP(tag, tag_exp, 16) == 0) ? "PASS":"FAIL", r);
    r = wc_ChaCha20Poly1305_Decrypt(key, iv, aad, sizeof(aad),
            ct, sizeof(ct), tag, dec);
    printf("ChaCha20-Poly1305 decrypt+verify: %s (r=%d)\r\n",
        (r == 0 && XMEMCMP(dec, pt, sizeof(pt)) == 0) ? "PASS":"FAIL", r);
}
#endif /* WOLF_CHACHA */

#ifdef WOLF_AESEXTRA
static void wolf_aes_cmac_ccm_test(void)
{
    /* AES-128-CMAC (NIST SP800-38B example, 16-byte message). */
    static const byte ck[16] = {
        0x2b,0x7e,0x15,0x16,0x28,0xae,0xd2,0xa6,
        0xab,0xf7,0x15,0x88,0x09,0xcf,0x4f,0x3c};
    static const byte cmsg[16] = {
        0x6b,0xc1,0xbe,0xe2,0x2e,0x40,0x9f,0x96,
        0xe9,0x3d,0x7e,0x11,0x73,0x93,0x17,0x2a};
    static const byte cmac_exp[16] = {
        0x07,0x0a,0x16,0xb4,0x6b,0x4d,0x41,0x44,
        0xf7,0x9b,0xdd,0x9d,0xd0,0x4a,0x28,0x7c};
    /* AES-128-CCM (RFC 3610 packet vector #1). */
    static const byte ek[16] = {
        0xc0,0xc1,0xc2,0xc3,0xc4,0xc5,0xc6,0xc7,
        0xc8,0xc9,0xca,0xcb,0xcc,0xcd,0xce,0xcf};
    static const byte enonce[13] = {
        0x00,0x00,0x00,0x03,0x02,0x01,0x00,0xa0,0xa1,0xa2,0xa3,0xa4,0xa5};
    static const byte eaad[8] = {0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07};
    static const byte ept[23] = {
        0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,0x10,0x11,0x12,0x13,
        0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b,0x1c,0x1d,0x1e};
    static const byte ect_exp[23] = {
        0x58,0x8c,0x97,0x9a,0x61,0xc6,0x63,0xd2,0xf0,0x66,0xd0,0xc2,
        0xc0,0xf9,0x89,0x80,0x6d,0x5f,0x6b,0x61,0xda,0xc3,0x84};
    static const byte etag_exp[8] = {
        0x17,0xe8,0xd1,0x2c,0xfd,0xf9,0x26,0xe0};
    static Aes aes;
    byte mac[16], cct[23], ctag[8], cdec[23];
    word32 macSz = sizeof(mac);
    int r;

